### 1. 아이코드몰에 있는 고객 id별 상품코드 나열(가로)
#### 고객 id가 중복되어 있음. (중복된 아이디별 상품코드가 각각 다름)

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('C:/Users/areum/Desktop/POC시연자료/가공전.csv')

In [3]:
df3=df.groupby('OrderID')['ProdCd'].apply(list).reset_index(name='new')

In [11]:
df3

                OrderID           new
0      2103190822000000  [1000000131]
1      2103191004000000  [1000000259]
2      2103191055000000  [1000000254]
3      2103191059000000  [1000000254]
4      2103191212000000  [1000000106]
...                 ...           ...
10121  2203181248000010  [1000000350]
10122  2203181326000010  [1000000351]
10123  2203181337000020  [1000000350]
10124  2203181356000020  [1000000176]
10125  2203181403000020  [1000000288]

[10126 rows x 2 columns]

In [4]:
df=df.groupby(by=['OrderID'], as_index=False).count()

In [5]:
a=df.ProdCd>=2
df=df[a]

In [6]:
df=df.reset_index(drop=True)

In [7]:
merge_outer = pd.merge(df,df3,on='OrderID')

In [8]:
merge_outer

,OrderID,ProdCd,new
0,2103191348000010,4,"[1000000245, 1000000230, 1000000228, 1000000107]"
1,2103191443000010,2,"[1000000236, 1000000236]"
2,2103191909000010,2,"[1000000107, 1000000053]"
3,2103201957000000,2,"[1000000230, 1000000177]"
4,2103202152000010,2,"[1000000254, 1000000245]"
...,...,...,...
4340,2203172352000050,7,"[1000000230, 1000000320, 1000000300, 100000030..."
4341,2203172356000050,3,"[1000000176, 1000000251, 1000000169]"
4342,2203180939000000,3,"[1000000245, 1000000176, 1000000351]"
4343,2203181011000000,2,"[1000000251, 1000000333]"
4344,2203181229000010,3,"[1000000225, 1000000261, 1000000251]"

In [9]:
new=merge_outer['new'].apply(lambda x: pd.Series(x))

In [10]:
new

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,1.000000e+09,1.000000e+09,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4340,1.000000e+09,1.000000e+09,1.000000e+09,1.000000e+09,1.000000e+09,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4341,1.000000e+09,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4342,1.000000e+09,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4343,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4344,1.000000e+09,1.000000e+09,1.000000e+09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN